{
  "Bag of Holding": {
    "type": "Adventurning Gear",
    "subtype": "Wondrous Item",
    "rarity": "Uncommon",
    "weight": "15",
    "description": "This bag has an interior space considerably larger than its outside dimensions, roughly 2 feet in diameter at the mouth and 4 feet deep. The bag can hold up to 500 pounds, not exceeding a volume of 64 cubic feet. The bag weighs 15 pounds, regardless of its contents. Retrieving an item from the bag requires an action.<br>If the bag is overloaded, pierced, or torn, it ruptures and is destroyed, and its contents are scattered in the Astral Plane. If the bag is turned inside out, its contents spill forth, unharmed, but the bag must be put right before it can be used again. Breathing creatures inside the bag can survive up to a number of minutes equal to 10 divided by the number of creatures (minimum 1 minute), after which time they begin to suffocate.<br>Placing a bag of holding inside an extradimensional space created by a Handy Haversack, Portable Hole, or similar item instantly destroys both items and opens a gate to the Astral Plane. The gate originates where the one item was placed inside the other. Any creature within 10 feet of the gate is sucked through it to a random location on the Astral Plane. The gate then closes. The gate is one-way only and can't be reopened."
  },
  "Decanter of Endless Water": {
    "type": "Adventurning Gear",
    "subtype": "Wondrous Item",
    "rarity": "Uncommon",
    "weight": "2",
    "description": "This stoppered flask sloshes when shaken, as if it contains water. The decanter weighs 2 pounds.<br>You can use an action to remove the stopper and speak one of three Command words, whereupon an amount of fresh water or salt water (your choice) pours out of the flask. The water stops pouring out at the start of your next turn. Choose from the following options:<br>1. 'Stream' produces 1 gallon of water.<br>2. 'Fountain' produces 5 gallons of water.<br>3. 'Geyser' produces 30 gallons of water that gushes forth in a geyser 30 feet long and 1 foot wide. As a Bonus Action while holding the decanter, you can aim the geyser at a creature you can see within 30 feet of you. The target must succeed on a DC 13 Strength saving throw or take 1d4 bludgeoning damage and fall prone. Instead of a creature, you can target an object that isn't being worn or carried and that weighs no more than 200 pounds. The object is either knocked over or pushed up to 15 feet away from you."
  },
  "": {
    "type": "Adventurning Gear",
    "subtype": "",
    "rarity": "",
    "weight": "",
    "description": ""
  }
}
