{
   "Shield":{
      "level":"1",
      "school":"Abjuration",
      "casting_time":"1 reaction",
      "range":"Self",
      "components":"V S",
      "duration":"1 round",
      "to_hit":"",
      "damage":"",
      "damage_type":"",
      "description":" Reaction trigger: You are hit by an attack or targeted by the magic missile spell.<br>An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile. ",
      "link":"https://www.dnd-spells.com/spell/shield"
   },
   "Expeditous Retreat":{
      "level":"1",
      "school":"Transmutation",
      "casting_time":"1 bonus reaction",
      "range":"Self",
      "components":"V S",
      "duration":"Concentration, up to 10 minutes",
      "to_hit": "",
      "damage": "",
      "damage_type":"",
      "description":"This spell allows you to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action.",
      "link":"https://www.dnd-spells.com/spell/expeditious-retreat"
   },
   "Chromatic Orb":{
      "level":"1",
      "school":"Evocation",
      "casting_time":"1 action",
      "range":"90 feet",
      "components":"V S M (a diamond worth at least 50 gp)",
      "duration":"Instantaneous",
      "to_hit":"Ranged Spell",
      "damage":"3d8",
      "damage_type":"Varies",
      "description":"You hurl a 4-inch-diameter sphere of energy at a creature that you can see within range. You choose acid, cold, fire, lightning, poison, or thunder for the type of orb you create, and then make a ranged spell attack against the target. If the attack hits, the creature takes 3d8 damage of the type you chose.",
      "higher_level":"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
      "link":"https://www.dnd-spells.com/spell/chromatic-orb"
   },
   "Disguise Self":{
      "level":"1",
      "school":"Illusion",
      "casting_time":"1 action",
      "range":"Self",
      "components":"V S",
      "duration":"1 hour",
      "to_hit":"",
      "damage":"",
      "damage_type":"",
      "description":" You make yourself – including your clothing, armor, weapons, and other belongings on your person – look different until the spell ends or until you use your action to dismiss it.<br>You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.<br>The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of som eone who reaches out to touch you would bump into you while it was seemingly still in midair. To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC. ",
      "link":"https://www.dnd-spells.com/spell/disguise-self"
   },
   "Suggestion":{
      "level":"2",
      "school":"Enchantment",
      "casting_time":"1 action",
      "range":"30 feet",
      "components":"V M (a snake’s tongue and either a bit of honeycomb or a drop of sweet oil)",
      "duration":"Concentration, up to 8 hours",
      "to_hit":"Wisdom Saving Throw",
      "damage":"",
      "damage_type":"",
      "description":"You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.<br>The target must make a Wisdom saving throw. On a failed save, it purses the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.<br>You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn’t met before the spell expires, the activity isn’t preformed.<br>If you or any of your companions damage the target, the spell ends.",
      "link":"https://www.dnd-spells.com/spell/suggestion"
   },
   "Crown of Madness":{
      "level":"2",
      "school":"Enchantment",
      "casting_time":"1 action",
      "range":"120 feet",
      "components":"V S",
      "duration":"Concentration, up to 1 minute",
      "to_hit":"Wisdom Saving Throw",
      "damage":"",
      "damage_type":"",
      "description":"One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration.<br>While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes.<br>The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. The target can act normally on its turn if you choose no creature or if none are within its reach.<br>On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the spell ends.",
      "link":"https://www.dnd-spells.com/spell/crown-of-madness"
   },
   "Poison Spray":{
      "level":"0",
      "school":"Conjuration",
      "casting_time":"1 action",
      "range":"10 feet",
      "components":"V S",
      "duration":"Instantaneous",
      "to_hit":"Constitution Saving Throw",
      "damage":{
         "1":"1d12",
         "2":"1d12",
         "3":"1d12",
         "4":"1d12",
         "5":"2d12",
         "6":"2d12",
         "7":"2d12",
         "8":"2d12",
         "9":"2d12",
         "10":"2d12",
         "11":"3d12",
         "12":"3d12",
         "13":"3d12",
         "14":"3d12",
         "15":"3d12",
         "16":"3d12",
         "17":"4d12",
         "18":"4d12",
         "19":"4d12",
         "20":"4d12"
      },
      "damage_type":"Poison",
      "description":"You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a Constitution saving throw or take 1d12 poison damage.",
      "link":"https://www.dnd-spells.com/spell/poison-spray"
   },
   "Fire Bolt":{
      "level":"0",
      "school":"Evocation",
      "casting_time":"1 action",
      "range":"120 feet",
      "components":"V S",
      "duration":"Instantaneous",
      "to_hit":"Ranged Spell",
      "damage":{
         "1":"1d10",
         "2":"1d10",
         "3":"1d10",
         "4":"1d10",
         "5":"2d10",
         "6":"2d10",
         "7":"2d10",
         "8":"2d10",
         "9":"2d10",
         "10":"2d10",
         "11":"3d10",
         "12":"3d10",
         "13":"3d10",
         "14":"3d10",
         "15":"3d10",
         "16":"3d10",
         "17":"4d10",
         "18":"4d10",
         "19":"4d10",
         "20":"4d10"
      },
      "damage_type":"Fire",
      "description":"You hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 fire damage. A flammable object hit by this spell ignites if it isn’t being worn or carried. ",
      "link":"https://www.dnd-spells.com/spell/fire-bolt"
   },
   "Light":{
      "level":"0",
      "school":"Evocation",
      "casting_time":"1 action",
      "range":"Touch",
      "components":"V M (a firefly or phosphorescent moss)",
      "duration":"1 hour",
      "to_hit":"Dexterity Saving Throw",
      "damage":"",
      "damage_type":"",
      "description":" You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.<br>If you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell. ",
      "link":"https://www.dnd-spells.com/spell/light"
   },
   "Minor Illusion":{
      "level":"0",
      "school":"Illusion",
      "casting_time":"1 action",
      "range":"30 feet",
      "components":"S M (a bit of fleece)",
      "duration":"1 minute",
      "to_hit":"",
      "damage":"",
      "damage_type":"",
      "description":"You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.<br>If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.<br>If you create an image of an object such as a chair, muddy footprints, or a small chest it must be no larger than a 5-foot cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.<br>If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
      "link":"https://www.dnd-spells.com/spell/minor-illusion"
   },
   "Shape Water":{
      "level":"0",
      "school":"Transmutation",
      "casting_time":"1 action",
      "range":"30 feet",
      "components":"S",
      "duration":"Instantaneous or 1 hour",
      "to_hit":"",
      "damage":"",
      "damage_type":"",
      "description":"You choose an area of water that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways: • You instantaneously move or otherwise change the flow of the water as you direct, up to 5 feet in any direction. This movement doesn’t have enough force to cause damage.<br> • You cause the water to form into simple shapes and animate at your direction. This change lasts for 1 hour.<br> • You change the water’s color or opacity. The water must be changed in the same way throughout. This change lasts for 1 hour.<br> • You freeze the water, provided that there are no crea- tures in it. The water unfreezes in 1 hour.<br>If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.",
      "link":"https://www.dnd-spells.com/spell/shape-water"
   },
   "Shocking Grasp":{
      "level":"0",
      "school":"Evocation",
      "casting_time":"1 Action",
      "range":"Touch",
      "components":"V S",
      "duration":"Instantaneous",
      "to_hit":"Melee spell attack",
      "damage":{
         "1":"1d8",
         "2":"1d8",
         "3":"1d8",
         "4":"1d8",
         "5":"2d8",
         "6":"2d8",
         "7":"2d8",
         "8":"2d8",
         "9":"2d8",
         "10":"2d8",
         "11":"3d8",
         "12":"3d8",
         "13":"3d8",
         "14":"3d8",
         "15":"3d8",
         "16":"3d8",
         "17":"4d8",
         "18":"4d8",
         "19":"4d8",
         "20":"4d8"
      },
      "damage_type":"Lightning",
      "description":"Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d8 lightning damage, and it can’t take reactions until the start of its next turn.",
      "link":"https://www.dnd-spells.com/spell/shocking-grasp"
   },
   "":{
      "level":"",
      "school":"",
      "casting_time":"",
      "range":"",
      "components":"",
      "duration":"",
      "to_hit":"",
      "damage":"",
      "damage_type":"",
      "description":"",
      "link":""
   }
}
